; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=43, remove_proportion=0.2, bases=8, instance_id=26, output=./training, seed=67

(define (problem warehouse-26)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 - box
        base1 base2 base3 base4 base5 base6 base7 base8 - base
    )
    (:init
        (to-remove box5)
        (to-remove box8)
        (to-remove box18)
        (to-remove box27)
        (to-remove box28)
        (to-remove box30)
        (to-remove box32)
        (to-remove box41)
        (clear box41)
        (on box41 box29)
        (on box29 box6)
        (on box6 box35)
        (on box35 box3)
        (on box3 box33)
        (on box33 box25)
        (on box25 box21)
        (on box21 box16)
        (on-base box16 base1)
        (clear box10)
        (on box10 box11)
        (on box11 box39)
        (on-base box39 base2)
        (clear box19)
        (on box19 box34)
        (on box34 box4)
        (on box4 box36)
        (on box36 box27)
        (on box27 box18)
        (on box18 box9)
        (on box9 box7)
        (on-base box7 base3)
        (clear box23)
        (on box23 box2)
        (on box2 box14)
        (on box14 box32)
        (on box32 box37)
        (on-base box37 base4)
        (clear box42)
        (on box42 box5)
        (on box5 box1)
        (on box1 box13)
        (on-base box13 base5)
        (clear box20)
        (on box20 box31)
        (on box31 box26)
        (on-base box26 base6)
        (clear box15)
        (on box15 box17)
        (on box17 box24)
        (on box24 box28)
        (on box28 box40)
        (on-base box40 base7)
        (clear box12)
        (on box12 box30)
        (on box30 box38)
        (on box38 box22)
        (on box22 box43)
        (on box43 box8)
        (on-base box8 base8)
    )
    (:goal (and 
        (removed box5)
        (removed box8)
        (removed box18)
        (removed box27)
        (removed box28)
        (removed box30)
        (removed box32)
        (removed box41)
    ))
)

; plan
1. (move box12 box30 box10)
   deleted: (clear box10) (on box12 box30)
   added: (on box12 box10) (clear box30)
   goals met: 0 of 8
2. (move box15 box17 box12)
   deleted: (clear box12) (on box15 box17)
   added: (on box15 box12) (clear box17)
   goals met: 0 of 8
3. (move box17 box24 box15)
   deleted: (clear box15) (on box17 box24)
   added: (on box17 box15) (clear box24)
   goals met: 0 of 8
4. (move box19 box34 box17)
   deleted: (clear box17) (on box19 box34)
   added: (on box19 box17) (clear box34)
   goals met: 0 of 8
5. (move box23 box2 box19)
   deleted: (clear box19) (on box23 box2)
   added: (on box23 box19) (clear box2)
   goals met: 0 of 8
6. (move box2 box14 box20)
   deleted: (clear box20) (on box2 box14)
   added: (on box2 box20) (clear box14)
   goals met: 0 of 8
7. (move box14 box32 box2)
   deleted: (clear box2) (on box14 box32)
   added: (on box14 box2) (clear box32)
   goals met: 0 of 8
8. (move box24 box28 box14)
   deleted: (clear box14) (on box24 box28)
   added: (on box24 box14) (clear box28)
   goals met: 0 of 8
9. (move box34 box4 box23)
   deleted: (clear box23) (on box34 box4)
   added: (on box34 box23) (clear box4)
   goals met: 0 of 8
10. (move box4 box36 box24)
   deleted: (clear box24) (on box4 box36)
   added: (on box4 box24) (clear box36)
   goals met: 0 of 8
11. (remove box28 box40)
   deleted: (on box28 box40) (clear box28)
   added: (removed box28) (clear box40)
   goals met: 1 of 8
12. (remove box30 box38)
   deleted: (on box30 box38) (clear box30)
   added: (removed box30) (clear box38)
   goals met: 2 of 8
13. (remove box32 box37)
   deleted: (on box32 box37) (clear box32)
   added: (removed box32) (clear box37)
   goals met: 3 of 8
14. (move box36 box27 box34)
   deleted: (clear box34) (on box36 box27)
   added: (on box36 box34) (clear box27)
   goals met: 3 of 8
15. (remove box27 box18)
   deleted: (on box27 box18) (clear box27)
   added: (removed box27) (clear box18)
   goals met: 4 of 8
16. (remove box18 box9)
   deleted: (on box18 box9) (clear box18)
   added: (removed box18) (clear box9)
   goals met: 5 of 8
17. (move box38 box22 box36)
   deleted: (clear box36) (on box38 box22)
   added: (on box38 box36) (clear box22)
   goals met: 5 of 8
18. (move box22 box43 box37)
   deleted: (clear box37) (on box22 box43)
   added: (on box22 box37) (clear box43)
   goals met: 5 of 8
19. (move box42 box5 box22)
   deleted: (clear box22) (on box42 box5)
   added: (on box42 box22) (clear box5)
   goals met: 5 of 8
20. (move box43 box8 box38)
   deleted: (clear box38) (on box43 box8)
   added: (on box43 box38) (clear box8)
   goals met: 5 of 8
21. (remove box41 box29)
   deleted: (on box41 box29) (clear box41)
   added: (removed box41) (clear box29)
   goals met: 6 of 8
22. (remove box5 box1)
   deleted: (on box5 box1) (clear box5)
   added: (removed box5) (clear box1)
   goals met: 7 of 8
23. (remove-from-base box8 base8)
   deleted: (on-base box8 base8) (clear box8)
   added: (removed box8) (clear-base base8)
   goals met: 8 of 8
